<template>
    <div class="about-page">
      <h1>О нас</h1>
      <div class="content">
        <p>
          Добро пожаловать в наш интернет-магазин косметики! Мы специализируемся на продаже высококачественных косметических средств, предназначенных для ухода за кожей, волосами и телом. 
          Наша цель — предоставить вам лучшие продукты, которые помогут вам выглядеть и чувствовать себя великолепно.
        </p>
        <p>
          Мы тщательно отбираем товары от ведущих производителей, чтобы предложить вам самые эффективные и безопасные средства. 
          В нашем ассортименте представлены продукты для различных типов кожи и решения для различных косметических проблем. 
          Независимо от того, что вы ищете — увлажнение, антивозрастной уход или защита от солнца — у нас вы найдете все необходимое.
        </p>
        <p>
          Наша команда экспертов всегда готова помочь вам с выбором и предоставить консультации по использованию продуктов. 
          Мы ценим каждого клиента и стремимся к тому, чтобы ваш опыт покупок был максимально приятным.
        </p>
        <p>
          Спасибо, что выбрали наш магазин. Мы надеемся, что вы останетесь довольны нашими товарами и сервисом!
        </p>
      </div>
    </div>
  </template>
  
  <script>
  export default {
    name: 'AboutPage',
  };
  </script>
  
  <style scoped>
  .about-page {
    max-width: 800px;
    margin: 0 auto;
    padding: 20px;
    font-family: Arial, sans-serif;
  }
  
  h1 {
    font-size: 2.5rem;
    color: #333;
    margin-bottom: 20px;
    text-align: center;
  }
  
  .content p {
    margin-bottom: 15px;
    line-height: 1.6;
    color: #555;
  }
  
  .content {
    background-color: #f9f9f9;
    padding: 20px;
    border-radius: 8px;
    box-shadow: 0 4px 8px rgba(0, 0, 0, 0.1);
  }
  
  .content p:last-child {
    margin-bottom: 0;
  }
  
  @media (max-width: 768px) {
    .about-page {
      padding: 10px;
    }
  
    h1 {
      font-size: 2rem;
    }
  
    .content p {
      font-size: 1rem;
    }
  }
  </style>
  